LaoGuoChen/-F4-Architecture-master/source/priph_cfg/src/stm32f4x_tim_config.c
/**
  ******************************************************************************
  * @file   stm32f4x_tim_config.c
  * @author  
  * @version V1.0
  * @date    2018.6.15
  * @brief   tim功能模块
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4x_tim_config.h"
#include "api_tim.h"

#define EXPAND_WRAPPER( __NEXTLEVEL__, ...)  __NEXTLEVEL__( __VA_ARGS__ )
#define _GET_TIM(x)                          TIM##x
#define GET_TIM(x)                           EXPAND_WRAPPER(_GET_TIM, x)
#define _GET_TIM_IRQ(x)                      TIM##x##_IRQn
#define GET_TIM_IRQ(x)                       EXPAND_WRAPPER(_GET_TIM_IRQ, x)
#define _GET_TIM2_7__12_14_RCC(x)            RCC_APB1Periph_TIM##x
#define GET_TIM2_7__12_14_RCC(x)             EXPAND_WRAPPER(_GET_TIM2_7__12_14_RCC, x)
#define _GET_TIM1__8_11_RCC(x)               RCC_APB2Periph_TIM##x
#define GET_TIM1__8_11_RCC(x)                EXPAND_WRAPPER(_GET_TIM1__8_11_RCC, x)
/* Private functions ---------------------------------------------------------*/

/**
  * @brief  初始化定时器定时操作
  * @param  load_value:计数装载值
  * @param  prescaler:预分频系数
  * @retval None
  */
void InitTimerToTime(const u16 load_value, const u16 prescaler)
{
    NVIC_InitTypeDef NVIC_InitStructure;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

#if ((TIM_TO_TIME_ID == 1) || ((TIM_TO_TIME_ID >= 8) && (TIM_TO_TIME_ID <= 11)))
    RCC_APB2PeriphClockCmd(GET_TIM1__8_11_RCC(TIM_TO_TIME_ID), ENABLE);
#else
    RCC_APB1PeriphClockCmd(GET_TIM2_7__12_14_RCC(TIM_TO_TIME_ID), ENABLE);
#endif 
    
	TIM_DeInit(GET_TIM(TIM_TO_TIME_ID));

	TIM_TimeBaseStructure.TIM_Period = load_value;         ///<装载值
	TIM_TimeBaseStructure.TIM_Prescaler = prescaler - 1;   /*!< 分频系数 APB1_Max = 36M APB2_Max = 72M 预分频系数为1时 不倍频 否则倍频 */
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(GET_TIM(TIM_TO_TIME_ID), &TIM_TimeBaseStructure);

    NVIC_InitStructure.NVIC_IRQChannel = GET_TIM_IRQ(TIM_TO_TIME_ID);
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
    
	TIM_ClearFlag(GET_TIM(TIM_TO_TIME_ID), TIM_FLAG_Update);
	TIM_ITConfig(GET_TIM(TIM_TO_TIME_ID), TIM_IT_Update, ENABLE);
	TIM_Cmd(GET_TIM(TIM_TO_TIME_ID), ENABLE);
}
/**
  * @brief  根据定时器号使能定时器时钟
  * @param  tim_id:定时器的编号
  * @retval None
  */
static void EnableTimRccClock(const u8 tim_id)
{
    switch (tim_id)
    {
        case 1:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);   ///<使能TIM1时钟
            break;
        case 2:
            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);   ///<使能TIM2时钟
            break; 
        case 3:
            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);   ///<使能TIM3时钟
            break;
        case 4:
            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);   ///<使能TIM4时钟
            break; 
        case 5:
            RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);   ///<使能TIM4时钟
            break; 
        case 8:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);   ///<使能TIM8时钟
            break; 
        case 9:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM9, ENABLE);   ///<使能TIM8时钟
            break; 
        case 10:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM10, ENABLE);   ///<使能TIM8时钟
            break; 
        case 11:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM11, ENABLE);   ///<使能TIM8时钟
            break; 
        default:
            break;
    }
}
/**
  * @brief  初始化定时器IO操作
  * @param  mode:
            -0:配置Tim为输入捕获
            -1:配置Tim为PWM输出
  * @param  tim_id:定时器的编号
  * @param  channel:通道数和，后四位每位的高低状态表示CH1-4的选择状态。如0x06表示选择了CH2和CH4.
  * @param  remap_par:重映射参数
  *         -0:无重映射
  *         -1:该串口有部分重映射则部分重映射，无则全重映射  
  *         -2:全重映射  
  * @retval None
  */
static void ConfigTimGpio(const u8 tim_id, const u8 channel, const u8 remap)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    u8 tim_id_remap = (((tim_id & 0x0f) << 4) | (remap & 0x0f));
    
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;  //复用功能输出
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      //推挽复用输出
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;        //上拉
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
    
    switch (tim_id_remap)
    {
        case 0x10:       
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);  ///<使能GPIOD时钟
            
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOA, GPIO_Pin_8);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOA, GPIO_Pin_9);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_10;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOA, GPIO_Pin_10);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_11;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource11, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOA, GPIO_Pin_11);	  
            }	            
        }
            break;
        case 0x11:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);  ///<使能GPIOD时钟
            
