LaoGuoChen/-F4-Architecture-master/source/priph_cfg/src/stm32f4x_tim_config.c
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOE, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOE, GPIO_PinSource9, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOE, GPIO_Pin_9);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_11;            
                GPIO_Init(GPIOE, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOE, GPIO_PinSource11, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOE, GPIO_Pin_11);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_13;            
                GPIO_Init(GPIOE, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOE, GPIO_PinSource13, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOE, GPIO_Pin_13);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_14;            
                GPIO_Init(GPIOE, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOE, GPIO_PinSource14, GPIO_AF_TIM1);
                GPIO_ResetBits(GPIOE, GPIO_Pin_14);	  
            }					
        }            
            break;
        case 0x20:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);  ///<使能GPIOD时钟

            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOA, GPIO_Pin_0);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOA, GPIO_Pin_1);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_2;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOA, GPIO_Pin_2);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOA, GPIO_Pin_3);	  
            }							
        }  
            break;
        case 0x21:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_15;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource15, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOA, GPIO_Pin_15);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource3, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOB, GPIO_Pin_3);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_10;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOB, GPIO_Pin_10);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_11;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_TIM2);
                GPIO_ResetBits(GPIOB, GPIO_Pin_11);	  
            }
        }
            break;
        case 0x30:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOA, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOA, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource0, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOB, GPIO_Pin_0);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource1, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOB, GPIO_Pin_1);	  
            }
        }
            break;
        case 0x31:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_4;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource4, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOB, GPIO_Pin_4);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_5;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource5, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOB, GPIO_Pin_5);	  
            }	
        }
            break;
        case 0x32:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);  ///<使能GPIOD时钟
            
