LaoGuoChen/-F4-Architecture-master/source/priph_cfg/src/stm32f4x_tim_config.c
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOC, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOC, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOC, GPIO_Pin_8);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_TIM3);
                GPIO_ResetBits(GPIOC, GPIO_Pin_9);	  
            }
        }
            break;
        case 0x40:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOB, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOB, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource8, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOB, GPIO_Pin_8);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource9, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOB, GPIO_Pin_9);	  
            }
        }
            break;
        case 0x41:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_12;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOD, GPIO_PinSource12, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOD, GPIO_Pin_12);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_13;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOD, GPIO_PinSource13, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOD, GPIO_Pin_13);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_14;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOD, GPIO_Pin_14);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_15;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_TIM4);
                GPIO_ResetBits(GPIOD, GPIO_Pin_15);	  
            }
        }
            break;
        case 0x50:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOA, GPIO_Pin_0);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOA, GPIO_Pin_1);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_2;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOA, GPIO_Pin_2);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOA, GPIO_Pin_3);	  
            }
        }
            break;
        case 0x51:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH | RCC_AHB1Periph_GPIOI, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_10;            
                GPIO_Init(GPIOH, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOH, GPIO_PinSource10, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOH, GPIO_Pin_10);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_11;            
                GPIO_Init(GPIOH, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOH, GPIO_PinSource11, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOH, GPIO_Pin_11);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_12;            
                GPIO_Init(GPIOH, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOH, GPIO_PinSource12, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOH, GPIO_Pin_12);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOI, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOI, GPIO_PinSource0, GPIO_AF_TIM5);
                GPIO_ResetBits(GPIOI, GPIO_Pin_0);	  
            }
        }
            break;
        case 0x80:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);  ///<使能GPIOD时钟
            
