LaoGuoChen/-F4-Architecture-master/source/priph_cfg/src/stm32f4x_tim_config.c
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOC, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOC, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOC, GPIO_Pin_8);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOC, GPIO_Pin_9);	  
            }
        }
            break;
        case 0x81:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOI, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_5;            
                GPIO_Init(GPIOI, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOI, GPIO_PinSource5, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOI, GPIO_Pin_5);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOI, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOI, GPIO_PinSource6, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOI, GPIO_Pin_6);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOI, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOI, GPIO_PinSource7, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOI, GPIO_Pin_7);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOI, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOI, GPIO_PinSource8, GPIO_AF_TIM8);
                GPIO_ResetBits(GPIOI, GPIO_Pin_8);	  
            }
        }
            break;
        case 0x90:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_2;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_TIM9);
                GPIO_ResetBits(GPIOA, GPIO_Pin_2);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_TIM9);
                GPIO_ResetBits(GPIOA, GPIO_Pin_3);	  
            }	
        }
            break;
        case 0x91:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_5;            
                GPIO_Init(GPIOE, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOE, GPIO_PinSource5, GPIO_AF_TIM9);
                GPIO_ResetBits(GPIOE, GPIO_Pin_5);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOE, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOE, GPIO_PinSource6, GPIO_AF_TIM9);
                GPIO_ResetBits(GPIOE, GPIO_Pin_6);	  
            }	
        }
            break;
        case 0xA0:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource8, GPIO_AF_TIM10);
                GPIO_ResetBits(GPIOB, GPIO_Pin_8);	  
            }	
        }
            break;
        case 0xA1:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOF, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOF, GPIO_PinSource6, GPIO_AF_TIM10);
                GPIO_ResetBits(GPIOF, GPIO_Pin_6);	  
            }	
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOF, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOF, GPIO_PinSource7, GPIO_AF_TIM10);
                GPIO_ResetBits(GPIOF, GPIO_Pin_7);	  
            }	
        }
            break;
        case 0xB0:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOB, GPIO_PinSource9, GPIO_AF_TIM11);
                GPIO_ResetBits(GPIOB, GPIO_Pin_9);	  
            }	
        }
            break;
        case 0xB1:
        {
            RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);  ///<使能GPIOD时钟
            
