LaoGuoChen/-F4-Architecture-master/source/priph_cfg/src/stm32f4x_tim_config.c
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOF, &GPIO_InitStructure);
                GPIO_PinAFConfig(GPIOF, GPIO_PinSource7, GPIO_AF_TIM11);
                GPIO_ResetBits(GPIOF, GPIO_Pin_7);	  
            }	
        }
            break;
        default:
            break;
    }
}
/**
  * @brief  根据定时器编号初始化对应参数
  * @param  tim_id:定时器的编号
  * @param  TIM_TimeBaseStructure:定时器的参数
  * @retval None
  */
static void InitTimeBase(const u8 tim_id, TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure)
{
    switch (tim_id)
    {
        case 1:
            TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break;
        case 2:
            TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        case 3:
            TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break;
        case 4:
            TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        case 5:
            TIM_TimeBaseInit(TIM5, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        case 8:
            TIM_TimeBaseInit(TIM8, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        case 9:
            TIM_TimeBaseInit(TIM9, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break;
        case 10:
            TIM_TimeBaseInit(TIM10, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        case 11:
            TIM_TimeBaseInit(TIM11, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        default:
            break;
    }

}
/**
  * @brief  初始化定时器输入捕获操作
  * @param  tim_id:定时器的编号
  * @param  channel:通道数和，后四位每位的高低状态表示CH1-4的选择状态。如0x06表示选择了CH2和CH4.
  * @param  remap_par:重映射参数
  *         -0:无重映射
  *         -1:该串口有部分重映射则部分重映射，无则全重映射  
  *         -2:全重映射  
  * @param  arr:重载计数
  * @param  psc:预分频系数
  * @retval None
  */
void InitTimToCap(const u8 tim_id, const u8 channel, const u8 remap, const u16 arr, const u16 psc)
{	 
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    TIM_ICInitTypeDef  TIM_ICInitStructure;
    u8 channel_index = 0;
    static u8 sub_priority = 0;

    EnableTimRccClock(tim_id);
    
    ConfigTimGpio(tim_id, channel, remap);
     
    TIM_TimeBaseStructure.TIM_Period = arr; ///<设定计数器自动重装值 
    TIM_TimeBaseStructure.TIM_Prescaler = psc; 	///<预分频器   
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; ///<设置时钟分割:TDTS = Tck_tim
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  ///<TIM向上计数模式

    InitTimeBase(tim_id, TIM_TimeBaseStructure);
    
    TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;	///<上升沿捕获
    TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI; ///<映射到TI1上
    TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;	 ///<配置输入分频,不分频 
    TIM_ICInitStructure.TIM_ICFilter = 0x00;///<IC1F=0000 配置输入滤波器 不滤波
        
    for (channel_index = 0; channel_index < 4; channel_index++)
    {
        if (!((channel >> channel_index) & 0x01))
        {
            continue;
        }
        
        if (channel_index == 0)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_1; 
        }
        else if (channel_index == 1)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;   
        }
        else if (channel_index == 2)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_3;
        }
        else if (channel_index == 3)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_4; 
        }
        switch (tim_id)
        {
            case 1:
                TIM_ICInit(TIM1, &TIM_ICInitStructure);    
                break;
            case 2:
                TIM_ICInit(TIM2, &TIM_ICInitStructure);    
                break; 
            case 3:
                TIM_ICInit(TIM3, &TIM_ICInitStructure);  
                break;
            case 4:
                TIM_ICInit(TIM4, &TIM_ICInitStructure);  
                break;             
            case 5:
                TIM_ICInit(TIM5, &TIM_ICInitStructure);  
                break;
            case 8:
                TIM_ICInit(TIM8, &TIM_ICInitStructure);  
                break;
            case 9:
                TIM_ICInit(TIM9, &TIM_ICInitStructure);  
                break;
            case 10:
                TIM_ICInit(TIM10, &TIM_ICInitStructure);  
                break;             
            case 11:
                TIM_ICInit(TIM11, &TIM_ICInitStructure);  
                break;            
            default:
                break;
        }
    }
    
    ///<中断分组初始化
    switch (tim_id)
    {
        case 1:
            NVIC_InitStructure.NVIC_IRQChannel = TIM1_CC_IRQn;   
            break;
        case 2:
            NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn; 
            break; 
        case 3:
            NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn; 
            break;
        case 4:
            NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;  
            break; 
        case 8:
            NVIC_InitStructure.NVIC_IRQChannel = TIM8_CC_IRQn; 
            break; 
        default:
            break;
    }
    
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;  
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = sub_priority++; 
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
    NVIC_Init(&NVIC_InitStructure);  
    
    switch (tim_id)
    {
        case 1:
            TIM_ITConfig(TIM1, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM1, ENABLE ); 	
            break;
        case 2:
            TIM_ITConfig(TIM2, TIM_IT_Update | (channel << 1), ENABLE);// TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | 
            TIM_Cmd(TIM2, ENABLE ); 
            break; 
        case 3:
            TIM_ITConfig(TIM3, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM3, ENABLE ); 
            break;
        case 4:
            TIM_ITConfig(TIM4, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM4, ENABLE );   
            break; 
        case 8:
            TIM_ITConfig(TIM8, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM8, ENABLE ); 
            break; 
        default:
            break;
    }
}
/**
  * @brief  初始化定时器PWM操作
  * @param  tim_id:定时器的编号
  * @param  channel:通道数和，后四位每位的高低状态表示CH1-4的选择状态。如0x06表示选择了CH2和CH4.
  * @param  remap_par:重映射参数
  *         -0:无重映射
  *         -1:该串口有部分重映射则部分重映射，无则全重映射  
  *         -2:全重映射  
  * @param  arr:重载计数
  * @param  psc:预分频系数
  * @retval None
  */
void InitTimToPwm(const u8 tim_id, const u8 channel, const u8 remap, const u16 arr, const u16 psc)
{

	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	TIM_OCInitTypeDef  TIM_OCInitStructure;
    u8 channel_index = 0;
    u8 tim_id_channel = 0;

    EnableTimRccClock(tim_id);
	
    ConfigTimGpio(tim_id, channel, remap);
    
