LaoGuoChen/-F4-Architecture-master/source/priph_cfg/src/stm32f4x_tim_config.c
	TIM_TimeBaseStructure.TIM_Period = arr; ///<设置自动重装载周期值
	TIM_TimeBaseStructure.TIM_Prescaler = psc; ///<设置预分频值 不分频
	TIM_TimeBaseStructure.TIM_ClockDivision = 0; ///<设置时钟分割:TDTS = Tck_tim
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  ///<TIM向上计数模式
	InitTimeBase(tim_id, TIM_TimeBaseStructure);	
	 
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2; ///<CH1 PWM2模式	
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; ///<比较输出使能
	TIM_OCInitStructure.TIM_Pulse = 0; ///<设置待装入捕获比较寄存器的脉冲值
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; ///<OC1 低电平有效 

	
    for (channel_index = 0; channel_index < 4; channel_index++)
    {
        if(!((channel >> channel_index) & 0x01))
        {
            continue;
        }
        
        tim_id_channel = (((tim_id & 0x0f) << 4) | (channel_index & 0x0f));

        switch (tim_id_channel)
        {
            case 0x10:
            {
                TIM_OC1Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x11:
            {
                TIM_OC2Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x12:
            {
                TIM_OC3Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x13:
            {
                TIM_OC4Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break;
            case 0x20:
            {
                TIM_OC1Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x21:
            {
                TIM_OC2Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x22:
            {
                TIM_OC3Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x23:
            {
                TIM_OC4Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break;   
            case 0x30:
            {
                TIM_OC1Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x31:
            {
                TIM_OC2Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x32:
            {
                TIM_OC3Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x33:
            {
                TIM_OC4Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break;
            case 0x40:
            {
                TIM_OC1Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x41:
            {
                TIM_OC2Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x42:
            {
                TIM_OC3Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x43:
            {
                TIM_OC4Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break; 
            case 0x50:
            {
                TIM_OC1Init(TIM5, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM5, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x51:
            {
                TIM_OC2Init(TIM5, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM5, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x52:
            {
                TIM_OC3Init(TIM5, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM5, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x53:
            {
                TIM_OC4Init(TIM5, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM5, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break;
            case 0x80:
            {
                TIM_OC1Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x81:
            {
                TIM_OC2Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x82:
            {
                TIM_OC3Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x83:
            {
                TIM_OC4Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break; 
            case 0x90:
            {
                TIM_OC1Init(TIM9, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM9, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x91:
            {
                TIM_OC2Init(TIM9, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM9, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x92:
            {
                TIM_OC3Init(TIM9, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM9, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x93:
            {
                TIM_OC4Init(TIM9, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM9, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break; 
            case 0xA0:
            {
                TIM_OC1Init(TIM10, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM10, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0xA1:
            {
                TIM_OC2Init(TIM10, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM10, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0xA2:
            {
                TIM_OC3Init(TIM10, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM10, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0xA3:
            {
                TIM_OC4Init(TIM10, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM10, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break; 
            case 0xB0:
            {
                TIM_OC1Init(TIM11, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM11, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0xB1:
            {
                TIM_OC2Init(TIM11, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM11, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0xB2:
            {
                TIM_OC3Init(TIM11, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM11, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0xB3:
            {
                TIM_OC4Init(TIM11, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM11, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break; 
        }
    }
    switch (tim_id)
    {
        case 1:
        {
            TIM_ARRPreloadConfig(TIM1, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM1, ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM1, ENABLE);  ///<使能TIMx        
        }
            break;
        case 2:
        {
            TIM_ARRPreloadConfig(TIM2, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM2,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM2, ENABLE);  ///<使能TIMx        
        }
            break;
        case 3:
        {
            TIM_ARRPreloadConfig(TIM3, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM3,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM3, ENABLE);  ///<使能TIMx        
        }
            break;
        case 4:
        {
            TIM_ARRPreloadConfig(TIM4, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM4,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM4, ENABLE);  ///<使能TIMx        
        }
            break;
        case 5:
        {
            TIM_ARRPreloadConfig(TIM5, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM5,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM5, ENABLE);  ///<使能TIMx        
        }
            break;
        case 8:
        {
            TIM_ARRPreloadConfig(TIM8, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM8,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM8, ENABLE);  ///<使能TIMx        
        }
            break;
        case 9:
        {
            TIM_ARRPreloadConfig(TIM9, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM9,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM9, ENABLE);  ///<使能TIMx        
        }
            break;
        case 10:
        {
            TIM_ARRPreloadConfig(TIM10, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM10,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM10, ENABLE);  ///<使能TIMx        
        }
            break;
        case 11:
        {
            TIM_ARRPreloadConfig(TIM11, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM11,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM11, ENABLE);  ///<使能TIMx        
        }
            break;
        default:
            break;
        
    }

}
/************************* (C) COPYRIGHT 2018 HWJ *********END OF FILE*********/
